
	Регистрация HIEW для России и exUSSR:

цена указана на странице: http://allsoft.ru/referal_reg.php?id=302

после регистрации высылается последняя версия без задержки,
и бесплатные обновления в течение года.

повторная регистрация по той же цене но бесплатные обновления 
в течение двух лет.

существует и более дешевый вариант покупки только одной версии 
без последущих обновлений.



                    Благодарю за поддержку !


                                         Евгений Сусликов, Кемерово 
                                          июль 1999 - январь 2012
                                             http://www.hiew.ru